#include "./User/includes.h"
#include "intrins.h"


#ifdef  STC12C5A60S2

//========================================================================
// 函数: void Delay1ms()		//@11.0592MHz
// 描述: 延时1毫秒函数
// 参数：无
// 返回: 无
// 版本: V1.0, 2022-10-17
//========================================================================
static void Delay1ms()		//@11.0592MHz
{
	unsigned char i, j;

	_nop_();
	i = 11;
	j = 190;
	do
	{
		while (--j);
	} while (--i);
}
//========================================================================
// 函数: delay_ms(u16 count)		//@11.0592MHz
// 参数：count,为需要延时的毫秒数，最大值为65535.
// 返回: 无
// 版本: V1.0, 2022-10-17
//========================================================================
void delay_ms(u16 count)		//@11.0592MHz
{
		while(count--)
		{
			Delay1ms();
		}
}

//========================================================================
// 函数: Delay50us(u16 count)		//@11.0592MHz
// 返回: 无
// 版本: V1.0, 2022-10-17
//========================================================================
void delay50us(void)	//@11.0592MHz
{
	unsigned char data i;

	_nop_();
	i = 135;
	while (--i);
}
#endif


#ifdef  STC15W4K48S4

//========================================================================
// 函数: void  delay_ms(unsigned char ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 这里只支持1~255ms. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2013-4-1
// 备注: 
//========================================================================
void  delay_ms(u16 ms)
{
     unsigned int i;
	 do{
	      i = MAIN_Fosc / 13000;
		  while(--i)	;   //14T per loop
     }while(--ms);
}

#endif




